const EGYPT_REGIONS = [
  {
    region: "القاهرة الكبرى",
    governorates: ["القاهرة", "الجيزة", "القليوبية"],
  },
  {
    region: "الوجه البحري",
    governorates: [
      "الإسكندرية",
      "البحيرة",
      "مطروح",
      "الغربية",
      "الشرقية",
      "الدقهلية",
      "المنوفية",
      "كفر الشيخ",
      "دمياط",
    ],
  },
  {
    region: "الوجه القبلي",
    governorates: [
      "الفيوم",
      "بني سويف",
      "المنيا",
      "أسيوط",
      "سوهاج",
      "قنا",
      "الأقصر",
      "أسوان",
    ],
  },
  {
    region: "محافظات القناة",
    governorates: ["الإسماعيلية", "بورسعيد", "السويس"],
  },
  {
    region: "المحافظات الحدودية وسيناء",
    governorates: ["شمال سيناء", "جنوب سيناء", "البحر الأحمر", "الوادي الجديد"],
  },
];

module.exports = EGYPT_REGIONS;
